//Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке 
//от M N
//M=1;  N =5 -> '1,2,3,4,5"
//M=4;  N =8 -> '4,5,6,7,8"

void RangeNaturNumbers (int numA, numB)
{
    if (numA == numB)
    {
        Console.WriteLine($"(numA)");
    }
}
